<a href="https://colab.research.google.com/github/Mike7Chu/SundayDeepLearning/blob/main/MC_Titanic/src/titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## 1. 라이브러리 및 데이터
### Library & Data

In [2]:
import pandas as pd
from sklearn.linear_model import LogisticRegression
from sklearn.tree import DecisionTreeClassifier

### pd.read_csv()
* csv파일 읽는 함수

In [4]:
# 데이터 불러오기
train = pd.read_csv('/content/data/test.csv')
# 모델 시험지 파일
test = pd.read_csv('/content/data/train.csv')
# 답안지 파일
submission = pd.read_csv('/content/data/submission.csv')

## 2. 탐색적 자료분석
### Exploratory Data Analysis(EDA)

### pd.DataFrame.head()
* 데이터 프레임의 위에서부터 n개 행을 보여주는 함수
* n의 기본 값(default 값)은 5

In [9]:
type(train)

train.head(6)

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S
5          897       3  ...   NaN        S

[6 rows x 11 columns]

In [10]:
test.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

* PassengerID : 탑승객 고유 아이디
* Survival : 탑승객 생존 유무 (0: 사망, 1: 생존)
* Pclass : 등실의 등급
* Name : 이름
* Sex : 성별
* Age : 나이
* Sibsp : 함께 탐승한 형제자매, 아내, 남편의 수
* Parch : 함께 탐승한 부모, 자식의 수
* Ticket :티켓 번호
* Fare : 티켓의 요금
* Cabin : 객실번호
* Embarked : 배에 탑승한 항구 이름 ( C = Cherbourn, Q = Queenstown, S = Southampton)